It has something to do with the group block. If I comment that out, if passes, otherwise it fails:

```hcl
  + resource "ibm_database" "elasticsearch" {
      + adminuser                 = (known after apply)
      + backup_encryption_key_crn = (known after apply)
      + configuration_schema      = (known after apply)
      + connectionstrings         = (known after apply)
      + groups                    = (known after apply)
      + guid                      = (known after apply)
      + id                        = (known after apply)
      + key_protect_key           = (known after apply)
      + location                  = "us-south"
      + name                      = "steve-es"
      + plan                      = "enterprise"
      + resource_controller_url   = (known after apply)
      + resource_crn              = (known after apply)
      + resource_group_id         = (known after apply)
      + resource_group_name       = (known after apply)
      + resource_name             = (known after apply)
      + resource_status           = (known after apply)
      + service                   = "databases-for-elasticsearch"
      + service_endpoints         = "private"
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = "8.12"

      + timeouts {
          + create = "120m"
        }
    }
 ```
 
 gives the base values.
 
 the group block values are:
 
 ```hcl
   group {
    group_id = "member"

    memory {
      allocation_mb = 4096 # also tried 1024
    }

    disk {
      allocation_mb = 5120
    }

    cpu {
      allocation_count = 0
    }

    members {
      allocation_count = 3
    }
  }
```
 